#-*-coding:utf-8-*-
#不定长参数
#**表示可以保存实参中带有“变量名”的参数
#在实参中的变量前加*或者**代表拆包，拆包后才能正确的吧参数传递到形参中
#*或者**：在形参中表示特殊的值；在实参中表示拆包
def test(a,b,c=33,*args,**kwargs):
    print (a)
    print (b)
    print (c)
    print (args)
    print (kwargs)

#结合上节所学，逆向思维，直接将元组，字典作为实参传递给形参

A=(11,22,33)
B={"name":"laowang","age":18}

test(11,22,33,A,B)
'''
11
22
33
((11, 22, 33), {'name': 'laowang', 'age': 18})  #发现将字典也扔进了元组，显然不是想要的效果
{}
'''

#拆包传递

test(11,22,33,*A,**B)
'''
这次经过拆包，得到了想要的结果
11
22
33
(11, 22, 33)
{'name': 'laowang', 'age': 18}
'''