#列表生成式

a = [i for i in range(10) if i%2==0]
print (a)
'''
[0, 2, 4, 6, 8]  使用if对生成的数字再做处理
'''

d = [i for i in range(3) for j in range(2)]
print (d)
'''
[0, 0, 1, 1, 2, 2]  i执行一次，j执行两次，结果不直观
'''

d = [(i,j) for i in range(3) for j in range(2)]     #同时打印多个值时，一定要带括号
print (d)
'''
[(0, 0), (0, 1), (1, 0), (1, 1), (2, 0), (2, 1)]
'''

e = [(i,j,k) for i in range(3) for j in range(2) for k in range(3)]

print (e)
'''
[(0, 0, 0), (0, 0, 1), (0, 0, 2), (0, 1, 0), (0, 1, 1), (0, 1, 2), (1, 0, 0), (1, 0, 1), (1, 0, 2), (1, 1, 0), (1, 1, 1), (1, 1, 2), (2, 0, 0), (2, 0, 1), (2, 0, 2), (2, 1, 0), (2, 1, 1), (2, 1, 2)]
'''